steps:

- Terminal Commands
  - pip install pandas(for anaconda: conda install numpy )
  - python -m pip install ipykernel(for conda : conda install ipykernel)
- for jupyter notebook:
  - its preinstalled in conda base env.
  - for normal installation use "pip install notebook"

# Pandas Series

> Pandas series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

- Pandas Series is nothing but a column in an excel sheet.

- To make a pandas series have to pass two arguments.
    - data
    - index

In [259]:
import pandas as pd
import numpy as np

In [260]:
#srating by creating labels
labels = ['a','b','c']
#data
my_data = [10,20,30]
#now transforming that data into numpy array
arr = np.array(my_data)
#we can also create a dictionary
#which contains labels as the keys and data as the values
d = {'a':10,'b':20,'c':30}

In [261]:
#Creating a Pandas series
pd.Series(data=my_data)
#Series is a one dimensional array
#similar to a column in a table
#here the index is numbers

0    10
1    20
2    30
dtype: int64

In [262]:
#series with index as labels
pd.Series(data=my_data,index=labels)
#here the data is a list

a    10
b    20
c    30
dtype: int64

In [263]:
#we can also create a series from a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [264]:
#we can also create a series from a dictionary
pd.Series(d)
#here the keys are the labels and the values are the data

a    10
b    20
c    30
dtype: int64

In [265]:
#we can add different types of object to a series
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [266]:
#here we can add built in finctions
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [267]:
#making 2 new series
series1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
series2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [268]:
#grabing data from series
series1['USA']
#this works as grabing data from a dictionary

1

In [269]:
#addition of series
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATA FRAMES

In [270]:
#importing numpy and pandas and randn
import numpy as np
import pandas as pd
from numpy.random import randn

In [271]:
#seeding makes the random numbers predictable and follows the same pattern
np.random.seed(101)

In [272]:
#start by creating  a dataframe
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [273]:
#grabbing the y column
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [274]:
#checking the type of data['Y']
type(df['Y'])

pandas.core.series.Series

In [275]:
#grabbing multiple columns
df[['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [276]:
#creating a new column
df['new'] = df['Y'] + df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [277]:
df.drop('new',axis=1,)
#deleting a column
#axis = 1 because we are deleting a column not a row
#the axis is set to 0 by default which denotes rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [278]:
#but there is no change in the dataframe permetently
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [279]:
#delet a column permanently
del df['new']
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [280]:
#or we can also delete by adding inplace=True
df.drop('Z',axis=1,inplace=True)

In [281]:
#we can also drop rows
df.drop('A',axis=0)
#axis is 0 by default which denotes rows

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [282]:
#and again if we run df
df

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [283]:
#so we have to add inplace=True
df.drop('A',axis=0,inplace=True)

In [284]:
df

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [285]:
#now you might think why axis 0 is rows and axis 1 is columns
#we can figure that out but finding the shape of the dataframe
df.shape

(4, 3)

> as deleting the rows and columns in previous lines we get a 4 rows and 3 columns <br>

> so when we are using shape we get a tuple of 4 and 3 where index 0 is 4 and index 1 is 3 <br>

> so pandas is smart enough to figure out the shape of the dataframe and <br>

> axis 0 is rows and axis 1 is columns

In [286]:
#making the dataframe again
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [287]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [288]:
#grabing rows
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [289]:
#index based locations
df.iloc[1]

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [290]:
#grabing a single element
df.iloc[1,1]
#or 
df.loc['A','Y']

-1.7060859307350775

In [291]:
#grabing multiple elements
df.loc[['A','B'],['Y','Z']]
#or with iloc
df.iloc[[0,1],[2,3]]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

# Indexing and Selection

In [292]:
#importing numpy and pandas and randn
import pandas as pd
import numpy as np

In [293]:
from numpy.random import randn
#seeding makes the random numbers predictable and follows the same pattern
np.random.seed(101)

In [294]:
#making a dataframe we are going to work on dataframe we made before
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Conditional Selection

In [295]:
df>0
#this will return a dataframe with boolean values

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [296]:
#grabing the values which are greater than 0
df[df>0]
#this will return a dataframe with NaN values
#its not very useful

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [297]:
# we need clean data
#so we use conditional selection
df['W'] > 0
#this will return a series with boolean values for the column W

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [298]:
#grabing the values which are greater than 0 in column W
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [299]:
#lets grab the values which are less than 0 in column z
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [300]:
#grabing the va;ues where column W is greater than 0 and storing it in a variable
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [301]:
# we can try to grab a single column from the resultdf
resultdf['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [302]:
#we can have the same result by doing this
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [303]:
#we can grab multiple columns from the resultdf by passing a list
resultdf[['Y','X']]
#or
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [304]:
#now lets make it simpler
#we can make a variable for the boolean values of column W where the values are greater than 0
boolser = df['W']>0
# we can make a list of columns we want to grab
result = ['Y','X']
#now we can pass the boolser and the result list to the dataframe
df[boolser][result]
#this way we can simplify the code and it won't look so messy and intimidating

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

## Multiple Conditions

we can pass two or more conditions in the same line like this
    
```python
df[(df['W']>0) and (df['Y']>1)]
```

but there will be an error becuse we are using `and` operator which is not supported in pandas
instead we have to use `&` operator

```python
df[(df['W']>0) & (df['Y']>1)]
```


> we can also use `|` operator for `or` operator

> we can also use `~` operator for `not` operator

> dont forget to use `()` for each condition

In [305]:
#we can pass multiple conditions
#lets try to grab the values where column W is greater than 0 and column Y is less than 1
#df[(df['W']>0) and (df['Y']>1)]

In [306]:
#the error says that we can't use the keyword and for series
#we have to use & for series
df[(df['W']>0) & (df['Y']<1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

## Index

In [307]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [308]:
# resetting the index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

won't reset permanently unless we use `inplace=True`
```python
df.reset_index()
```

In [309]:
df
# it won't reset the index permanently

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [310]:
#creatinga new index
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [311]:
#adding a new column
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [312]:
#now we can reset the index into the states column
df.set_index('States')
#keep in mind that it won't reset the index permanently
#we have to add inplace=True

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi Index and Index Hierarchy

In [313]:
import pandas as pd
import numpy as np

In [314]:
outside = ['G1','G1','G1','G2','G2','G2']
#outside variable is a list of 6 elements
inside = [1,2,3,1,2,3]
#inside variable is a list of 6 elements but the elements are repeated

In [315]:
#zip will combine the two lists, outside and inside according to their index
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [316]:
hier_index = pd.MultiIndex.from_tuples(hier_index) # this will create a multi index, from tuples function will take a list of tuples and create a multi index
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

multi index is `index on index`, meaning you have two indexes on a single column

In [317]:

df =pd.DataFrame(randn(6,2),hier_index,['A','B'])
#i created a dataframe with 6 rows and 2 columns, the index is hier_index and the columns are A and B
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [318]:
df.loc["G1"]
#grabing the values from G1

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [319]:
df.loc["G1"].loc[1]
#grabing the values from G1 and index 1

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [320]:
df.index.names = ['Groups','Num']
# we can name the indexs, i named the indexs as Groups and Num
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [321]:
#grabing the values from G2 and index 2 and column B
df.loc["G2"].loc[2]['B']

0.07295967531703869

### cross sections

In [322]:
#grabbing everything with the index of 1
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

In [323]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [324]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [325]:
#dropna method
df.dropna() #this will drop all the rows with NaN values

     A    B  C
0  1.0  5.0  1

In [326]:
#to drop columns with NaN values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [327]:
#thresh holds 
df.dropna(thresh=2) #meaning that it will drop all the rows with 2 or more NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [328]:
#filling the NaN values
df.fillna(value='FILL VALUE') #this will fill all the NaN values with FILL VALUE

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [329]:
df['A'].fillna(value=df['A'].mean()) #this will fill all the NaN values in column A with the mean of column A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

> non of these are permanent unless we use `inplace=True` inside the `dropna()` or `fillna()` function

In [330]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Group by

Groupby allows you to group together rows based off of a column and perform an aggregate function on them.

In [331]:
#a new dataframe with company names and their sales
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data=data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [332]:
#this will give a groupby object
df.groupby('Company')

In [333]:
#we can save it in a variable
byComp = df.groupby('Company')

In [334]:
#now we can use aggregate functions on it
byComp['Sales'].mean() #this will give the mean of sales of each company

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [335]:
#you can also do other aggregate functions
byComp.sum() #this will give the sum of sales of each company

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [336]:
#standard deviation
byComp['Sales'].std() #this will give the standard deviation of sales of each company

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [337]:
#you can get the value of a single company
byComp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [338]:
byComp.count() #this will give the count of each company

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [339]:
#you can call all in one line
df.groupby('Company').sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [340]:
#there is a method called describe which will give you a lot of information
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [341]:
#you can also transpose it
df.groupby('Company').describe().transpose() #this will change the rows into columns and columns into rows

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [342]:
#you can also call a specific column
df.groupby('Company').describe().transpose()['FB'] #this will give you the information of FB company

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining and Concatenating

In [343]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [344]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [345]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [346]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation

In [347]:
#concatenation
pd.concat([df1,df2,df3]) #this will concatenate the dataframes vertically

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [348]:
#concatenation horizontally
pd.concat([df1,df2,df3],axis=1) #axis=1 means horizontally

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [349]:
# example dataframes
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                         'A': ['A0', 'A1', 'A2', 'A3'],
                         'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                                'C': ['C0', 'C1', 'C2', 'C3'],
                                'D': ['D0', 'D1', 'D2', 'D3']})

In [350]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [351]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

### Merging

In [352]:
pd.merge(left,right,how='inner',on='key') #this will merge the dataframes on the basis of key column

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [353]:
#complecated example
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [354]:
#merging on the basis of key1 and key2
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [355]:
#merging on the basis of key1 and key2 and keeping all the values
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [356]:
#merging on the basis of key1 and key2 and keeping only the values which are common
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [357]:
#merging on the basis of key1 and key2 and keeping all the values from left dataframe
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [358]:
#merging on the basis of key1 and key2 and keeping all the values from right dataframe
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Joining

In [359]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [360]:
#joining is almost same as merging but the keys are the indexs
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [361]:
left.join(right,how='outer') #this will keep all the values

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [362]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [363]:
#finding unique values
df['col2'].unique() #returns a numpy array of unique values

array([444, 555, 666], dtype=int64)

In [364]:
df.value_counts()

col1  col2  col3
1     444   abc     1
2     555   def     1
3     666   ghi     1
4     444   xyz     1
Name: count, dtype: int64

In [365]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [366]:
#a very useful method called apply
def times2(x):
    return x*2
#we have created a function which will multiply the value by 2

In [367]:
#we can use apply method to apply the function to the dataframe
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [368]:
#lets say we want to find the length of each string in col3
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [369]:
#we can also use lambda expressions
df['col2'].apply(lambda x: x*2) #this will multiply each value by 2

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [370]:
#df columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [371]:
#df index
df.index

RangeIndex(start=0, stop=4, step=1)

In [372]:
#Sorting
df.sort_values(by='col2') #this will sort the values of col2 in ascending order

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [373]:
#finding null values
df.isnull() #this will return a dataframe with boolean values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [374]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data=data)

In [375]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [376]:
#pivot table refers to excel pivot tables meaning that it will create a multi index dataframen with the values of D column as the values of the dataframe
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## DATA INPUT AND OUTPUT
**Data Sources**
there are many data sources like:
- CSV
- Excel
- HTML
- SQL
- JSON


>Pandas can read all of these data sources but in order to read `html` and `sql` we need to install some libraries.

- pip install sqlalchemy
- pip install lxml
- pip install html5lib
- pip install BeautifulSoup4

In [377]:
#reading csv files
df = pd.read_csv('source/example')

In [378]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [379]:
df.to_csv('source/My_output',index=False) #this will create a csv file with the name My_output

In [380]:
dff = pd.read_csv('source/My_output')

In [381]:
dff

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [382]:
df = pd.read_excel('source/Excel_Sample.xlsx',sheet_name='Sheet1') #this will read the excel file but you might get an error because you have to install xlrd

In [383]:
df.to_excel("source/excel_sample2.xlsx",sheet_name='NewSheet') #this will create an excel file with the name excel_sample2.xlsx")

In [384]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [385]:
df[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538

In [386]:
from sqlalchemy import create_engine

In [387]:
engine = create_engine('sqlite:///:memory:')

In [388]:
df[0].to_sql('my_table',engine)

567

In [389]:
sqldf = pd.read_sql('my_table',con=engine)

In [390]:
sqldf

,index,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,3,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
4,4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
...,...,...,...,...,...,...,...,...
562,562,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
563,563,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
564,564,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
565,565,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
566,566,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

# congo!!!